{"config": {"input_layers": [["images", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 68, 128, 1], "dtype": "float32", "name": "images"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "images"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "dtype": "float32", "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d"}, "inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "dtype": "float32", "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_1"}, "inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "dtype": "float32", "trainable": true, "name": "max_pooling2d"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "dtype": "float32", "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_2"}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "dtype": "float32", "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_3"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "dtype": "float32", "trainable": true, "name": "max_pooling2d_1"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "filters": 64, "dtype": "float32", "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_4"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "dtype": "float32", "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_5"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "dtype": "float32", "trainable": true, "name": "max_pooling2d_2"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"config": {"name": "flatten", "dtype": "float32", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten"}, {"config": {"bias_constraint": null, "units": 256, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "dense", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "name": "dense"}, {"config": {"noise_shape": null, "rate": 0.2, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout"}, "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout"}, {"config": {"bias_constraint": null, "units": 128, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"noise_shape": null, "rate": 0.2, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"bias_constraint": null, "units": 1, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "left", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "left"}, {"config": {"bias_constraint": null, "units": 1, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "name": "right", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "right"}], "output_layers": [["left", 0, 0], ["right", 0, 0]], "name": "model"}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.6-tf"}